app/Models/Register_model.php

SELECT *
FROM `tbl_produact`
WHERE `id` = '2'
---
    public function getProductById($productId)
    {
        return $this->db->table('tbl_produact') // Assuming 'products' is your product table
                        ->where('id', $productId)
                        ->get()
                        ->getRow();

SELECT *
FROM `register`
WHERE `id` = '5'
---
    public function getuserById($getuserById)
    {
        return $this->db->table('register') // Assuming 'products' is your product table
                        ->where('id', $getuserById)
                        ->get()
                        ->getRow();